import React, { useRef } from "react";
import { NavLink } from "react-router-dom";

import frontendToolsImg from "./../assets/img-blog/tools.jpg";
import arrowUpImg from "./../assets/img-blog/arrow-up-fill.svg";
import homeImg from "./../assets/img-blog/home.svg";

import classes from "./FrontendToolsBlog.module.css";
import Footer from "../components/Footer/Footer";
import BlogHeader from "../components/Navigation/BlogHeader";

const FrontendToolsBlog = () => {
  const textRef = useRef();

  const navigateToTop = () => {
    textRef.current.scrollIntoView({ behavior: "smooth" });
  };
  return (
    <>
      <BlogHeader />
      <section className={classes.blog}>
        <div className={classes.blog_header}>
          <h1 ref={textRef}>معرفی ۶ ابزار برای توسعه‌دهندگان Front-End</h1>
          <div className={classes.blog_detail}>
            <a href="https://roocket.ir/articles/checkout-front-end-web-development-tools">
              منبع خبر : roocket.ir
            </a>
            <time> تاریخ : 1400/7/30</time>
          </div>
        </div>
        <div className={classes.blog_headerImg}>
          <img src={frontendToolsImg} />
        </div>
        <article className={classes.blog_article}>
          <p>
            اگر به صورت کلی ابزارهایی که یک توسعه‌دهنده فرانت-اند نیاز دارد را
            نام ببریم می‌توانیم تنها به HTML/CSS/Javascript اکتفا کنیم. اما
            واقعیت آن است که در دنیای وب مدرن ابزارهای بسیار بیشتری نسبت به این
            سه مورد وجود دارند که یک توسعه‌دهنده فرانت-اند نیاز دارد تا آن‌ها را
            یاد بگیرد. در حال حاضر نیز هزاران ابزار مختلف بوجود آمده که مطمئناً
            یادگیری تمام آن‌ها برای یک نفر امکان‌پذیر نیست. با این حال ما در این
            مطلب از وبسایت راکت قصد داریم ۶ تکنولوژی را به شما معرفی کنیم که
            یادگیری آن‌ها می‌تواند شما را به توسعه‌دهنده بسیار بهتری تبدیل کند.
          </p>
          <h2>۱. Chrome DevTools</h2>
          <p>
            در بین توسعه‌دهندگان وب مرورگر کروم بیشترین محبوبیت را دارد. این
            موضوع فقط بدلیل خوب بودن در امر جستجو و مرور صفحات وب نیست؛ گوگل
            کروم مجموعه‌ای از ابزارهای بسیار عالی را در اختیار توسعه‌دهندگان
            قرار می‌دهد تا بتوانند از طریق آن کارهای مربوط به توسعه رابط کاربری
            را انجام دهند. اگر به المان‌های پایه‌ای این ابزار اشاره کنیم
            می‌توانیم دیباگر، کنسول جاوااسکریپت، قابلیت‌های auto-complition برای
            کدنویسی به صورت مستقیم و… اشاره کرد. اما جدای از این موارد ابزارهای
            پیشرفته‌ای مانند مانیتور شبکه، بررسی کارایی اپلیکیشن، میزان استفاده
            از حافظه و… را نیز در خود جای داده است. یکی دیگر از قابلیت‌های بسیار
            کاربردی آن نمایش صفحات وب در دستگاه‌های مختلف از جمله موبایل و تبلت
            است. اگر از جمله توسعه‌دهندگانی هستید که به واکنشگرا بودن صفحات‌تان
            اهمیت بسیار زیادی می‌دهید این ابزار می‌تواند برای‌تان کاربردی باشد.
          </p>
          <h2>۲. npm</h2>
          <p>
            npm به صورت پایه‌ای یک پکیج منیجر برای پلتفرم نودجی‌اس است. با این
            حال جدای از یک پکیج منیجر بودن قابلیت‌هایی مانند مدیریت پروژه را نیز
            دارد. اما به عنوان یک توسعه‌دهنده وب فارغ از آنکه با چه
            تکنولوژی‌هایی کار می‌کنید یادگیری npm بسیار ضروری است. در حال حاضر
            تعداد پکیج‌های مربوط به npm از ۸۰۰هزار عدد پیشی گرفته و این آمار روز
            به روز نیز در حال افزایش است.
          </p>
          <h2>۳. Angular</h2>
          <p>
            انگولار را می‌توان یکی از موفق‌ترین و محبوب‌ترین فریمورک‌های
            جاوااسکریپتی دانست. انگولار ویژگی‌های بسیار حرفه‌ای‌تری را به نسبت
            دیگر فریمورک‌ها به توسعه‌دهندگان فرانت-اند ارائه می‌کند. این فریمورک
            در سال ۲۰۱۲ توسط گوگل ایجاد شد. در ابتدای امر این فریمورک Angular.js
            نام داشت و برای کار با آن تنها چیزی که نیاز به دانستن‌ش داشتید
            جاوااسکریپت بود. اما نسخه‌های جدید این فریمورک با استفاده از
            تایپ‌اسکریپت نوشته شده‌اند و برای کار با آن‌ها نیاز است تا از
            تایپ‌اسکریپت استفاده کنید.{" "}
          </p>
          <h2>۴. Ionic</h2>
          <p>
            حدس‌های بسیار زیادی در ارتباط با آمار پیشرفت وب اپلیکیشن‌های
            پیش‌رونده وجود دارد. اما در این میان Ionic می‌گوید که تا سال ۲۰۲۰ یک
            دوم تمام اپلیکیشن‌های دنیا به PWA یا همان اپلیکیشن پیش‌رونده خواهند
            بود.
          </p>
          <p>
            Ionic یکی از محبوب‌ترین SDKها برای ایجاد اپلیکیشن‌های پیش‌رونده و
            اپلیکیشن‌های چند-سکویی است. جامعه کاربری این فریمورک بسیار بزرگ است
            از این رو منابع یادگیری بسیار زیادی در اختیار شما قرار خواهد گرفت.
            در اوایل ساخت، این فریمورک از Angular برای رندر المنت‌های
            اپلیکیشن‌های ساخته شده استفاده می‌کرد اما در نسخه‌های جدید این
            فریمورک سراغ تکنولوژی Web Components رفته است.
          </p>
          <h2>۵. HTML۵ Boilerplate</h2>
          <p>
            HTML۵ Boilerplate برای آن طراحی شده که روند کدنویسی را ساده‌تر کند.
            در حقیقت این مورد پروژه‌ای که روال کدنویسی HTML۵ را با استفاده از
            یکسری المان‌های بهینه و قدرتمند‌، سریع‌تر می‌کند. البته ممکن است در
            برخی موارد این پروژه نتواند بهترین گزینه برای پروژه‌های بزرگ باشد
            اما از آنجایی که جامعه کاربری نسبتاً بزرگی دارد می‌تواند در مواجه با
            مشکلات کمک‌های بسیاری به شما بکند.
          </p>
          <h2>۶. Vue</h2>
          <p>
            Vue فریمورکی است که تمام قابلیت‌های مورد انتظار از یک فریمورک
            جاوااسکریپتی را به شما می‌دهد. اما تفاوت این فریمورک به نسبت دیگر
            موارد در یک چیز است: توسعه اپلیکیشن با استفاده از ویوجی‌اس بسیار
            آسان است. این ویژگی باعث شد تا ویوجی‌اس به عنوان یکی از محبوب‌ترین
            فریمورک‌های دنیای جاوااسکریپت شناخته شود. ما در راکت نیز از ویوجی‌اس
            برای توسعه فرانت-اند استفاده می‌کنیم.
          </p>

          <div className={classes.blog_article__navIcons}>
            <div className={classes.Rdiv}>
              <img src={arrowUpImg} onClick={navigateToTop} />
            </div>
            <div className={classes.Ldiv}>
              <NavLink
                to="/"
                className={(navData) =>
                  navData.isActive ? "" : classes.bloglink
                }
              >
                <img src={homeImg} />
              </NavLink>
            </div>
          </div>
        </article>
      </section>
      <Footer />
    </>
  );
};

export default FrontendToolsBlog;
