import React, { useRef } from "react";
import { NavLink } from "react-router-dom";

import reactImg from "./../assets/img-blog/react.jpg";
import centerReactImg from "./../assets/img-blog/react-center.png";
import arrowUpImg from "./../assets/img-blog/arrow-up-fill.svg";
import homeImg from "./../assets/img-blog/home.svg";

import classes from "./WhatIsReactBlog.module.css";
import Footer from "../components/Footer/Footer";
import BlogHeader from "../components/Navigation/BlogHeader";

const WhatIsReactBlog = () => {
  const textRef = useRef();

  const navigateToTop = () => {
    textRef.current.scrollIntoView({ behavior: "smooth" });
  };

  return (
    <>
      <BlogHeader />
      <section className={classes.blog}>
        <div  className={classes.blog_header}>
          <h1 ref={textRef}>
            کتابخانه ی ReactJS چیست و چه کارهایی می توان با آن انجام داد؟
          </h1>
          <div className={classes.blog_detail}>
            <a href="https://virgool.io/iran-react-community/%DA%86%DB%8C%D8%B3%D8%AA-%D9%88-%DA%86%D9%87-%DA%A9%D8%A7%D8%B1%D9%87%D8%A7%DB%8C%DB%8C-%D9%85%DB%8C-%D8%AA%D9%88%D8%A7%D9%86-%D8%A8%D8%A7-%D8%A2%D9%86-%D8%A7%D9%86%D8%AC%D8%A7%D9%85-%D8%AF%D8%A7%D8%AF-reactjs-jkwe0w661tu2">
              منبع خبر : virgool.io
            </a>
            <time> تاریخ : 1400/6/14</time>
          </div>
        </div>
        <div className={classes.blog_headerImg}>
          <img src={reactImg} />
        </div>
        <article className={classes.blog_article}>
          <p>
            در سال ۲۰۱۱ این کتابخانه را تحت تاثیر XHP که یک کامپوننت Html برای
            زبان برنامه نویسی PHP‌ است، ایجاد شده است و در همین سال React روی
            قسمت News Feed شبکه اجتماعی فیسبوک به کار گرفته شد و ۲ سال بعد، یعنی
            در سال ۲۰۱۳ هم استفاده از آن توسط فیسبوک به اینستاگرام تعمیم پیدا
            کرد.
          </p>
          <p>
            ری اکت یک کتابخانه متن باز (Open source) جاوا اسکریپت است که به دلیل
            بهینه بودن React.js برای دریافت اطلاعاتی که با سرعت تغییر می‌کنند،
            می‌توان از آن برای توسعه برنامه ی تک صفحه ایی(SPA) یا برنامه‌های
            موبایل استفاده کرد, یکی از سریع‌ترین و محبوب‌ترین کتابخانه‌ها
            (Library) جاوا اسکریپت است که توسط فیسبوک اینستاگرام و یک جامعه
            مستقل از توسعه دهندگان وب مدیریت و نگهداری می‌شود.
          </p>
          <p>
            براساس آنالیزهای جاوااسکریپت سرویس لیبسکور، ری‌اکت در حال حاضر در
            سایت‌های نت فلکس، ایمجر، بلیچر ریپورت، فیدلی، ایر بی ان بی و … مورد
            استفاده قرار می‌گیرد.
          </p>
          <p>
            نکته مهم در کاربرد React.js سادگی و یادگیری آسان آن است و همچنین این
            کتابخانه صرفا در الگوی طراحی MVC، عهده‌دار بخش View است. View یا
            اینترفیس در واقع مرتبط با نمایش اجزا هست و طبعا React.js به جای
            پرداختن به الگوی MVC به وظایفی می‌پردازد که مربوط به نمایش اجزا است.
          </p>
          <p>
            کتابخانه React.js این قابلیت را برای برنامه نویسان می دهد تا برنامه
            های کاربردی تحت وب طراحی کنند که بدون بارگزاری مجدد صفحه می توان
            اطلاعات آن را تغییر داد. هدف اصلی کتابخانه React.js سریع بودن، قابل
            توسعه بودن و ساده بود و مقیاس پذیر بودن آن است, ما می توانیم عناصر
            رابط کاربری مانند یک دکمه یا یک قسمت ورودی را به عنوان یک کامپوننت
            ری اکت بنویسیم. یک کامپوننت ممکن است یک یا چند کامپوننت دیگر را در
            خروجی خود داشته باشد و می توانیم کامپوننت هایی با قابلیت استفاده
            مجدد نیز طراحی و ایجاد کنیم.
          </p>
          <p>حال برخی از ویژگی های React.js را بررسی می کنیم:</p>
          <div className={classes.blog_mainImg}>
            <img src={centerReactImg} />
          </div>
          <h2>جی اس ایکس (jsx) در React.js</h2>
          <p>
            در React.js ، برای قالب بندی به جای استفاده از جاوا اسکریپت معمولی
            از JSX استفاده می شود. JSX یک جاوا اسکریپت ساده است که از HTML پیروی
            می کند و از این دستورات تگ HTML برای ارائه زیر کامپوننت ها در React
            استفاده می کند. زبان HTML به منظور پاسخ به فراخوانی های جاوا اسکریپت
            از سوی کتابخانه ی React پردازش شده است. در اینجا ما حتی می توانیم به
            زبان خالص قدیمی جاوا اسکریپت نیز کد بنویسیم.
          </p>
          <h2>جریان اطلاعات تک خطی در React.js</h2>
          <p>
            در React.js ، مجموعه ای از متغیرهای غیرقابل تغییر به عنوان مشخصه
            هایی در تگ های HTML خود به ارائه دهنده کامپوننت ها منتقل می شوند.
            کامپوننت ها نمی توانند به طور مستقیم هر خواصی را تغییر دهند اما می
            توانند بازگشتی یک تابع فراخوانی شده را قبول کنند بدین ترتیب ما می
            توانیم تغییرات خود را اعمال کنیم. تمام این فرآیند ها به شرح فوق
            شناخته شده اند: “جریان خاصیت ها کاهش می یابد ، جریان واکنش ها افزایش
            می یابد”.
          </p>
          <h2>پراپس ها در React.js</h2>
          <p>
            پراپس ها باعث می شوند که مجموعه کامپوننت ها بتوانند از داده های
            سفارشی استفاده کنند. پراپس ها در React.js این امکان را فراهم می کنند
            تا داده های سفارشی به یک UI سفارشی انتقال خاصی انتقال پیدا کنند.
          </p>
          <h2>
            ری اکت جی اس از DOM مجازی برای سرعت بخشیدن به برنامه استفاده می کند
          </h2>
          <p>
            این ساختار که به اختصار Virtual DOM نامیده می‌شود، ابتدا تغییرات
            انجام شده را محاسبه کرده و سپس مرورگر کاربر را آپدیت می‌کند. این
            ویژگی به طراح سایت و توسعه دهنده این امکان را می‌دهد که به گونه‌ای
            کد نویسی کند که انگار تمام صفحه با هر تغییر رندر می‌شود، در حالی که
            در واقع کتابخانه React تنها کامپوننت‌هایی را رندر می‌کند که واقعا
            تغییر کرده‌اند.
          </p>
          <h2>ویژگی Single-Way data flow</h2>
          <p>
            در React.js، مجموعه‌ای از value های تغییر ناپذیر بین کامپوننت‌ها به
            عنوان ویژگی‌هایی(properties) در برچسب‌های HTML منتقل می‌شوند.
            کامپوننت‌ها به طور مستقیم نمی‌توانند هیچ یک از ویژگی‌ها (properties)
            را تغییر دهند اما میتوان آن‌ها را به call back function انتقال دهند
            و به کمک آن‌ها تغییرات را انجام دهند. این فرآیند به طور کامل با
            “properties flow down; actions flow up” شناخته می‌شود.
          </p>
          <p>
            اگر دلتان می‌خواهد یک تکنولوژی جدید یاد بگیرید که در تمام دوران
            حرفه‌ای وکاری خود از دانستن آن به خود ببالید، به شما پیشنهاد می‌کنم
            React.js را یادبگیرید امیدوارم متوجه شده باشید React.js چیه و بتونید
            با یادگیری این کتابخانه به توسعه پروژه های خودتون بپردازید و موقعیت
            های شغلی خوبی بدست بیارید.
          </p>
          <div className={classes.blog_article__navIcons}>
            <div className={classes.Rdiv}>
              <img src={arrowUpImg} onClick={navigateToTop} />
            </div>
            <div className={classes.Ldiv}>
              <NavLink
                to="/"
                className={(navData) =>
                  navData.isActive ? "" : classes.bloglink
                }
              >
                <img src={homeImg} />
              </NavLink>
            </div>
          </div>
        </article>
      </section>
      <Footer />
    </>
  );
};

export default WhatIsReactBlog;
